app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Kacey"], ["last_name", "Musgraves"], ["created_at", "2020-04-28 18:03:32.974414"], ["updated_at", "2020-04-28 18:03:32.974414"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Holly"], ["updated_at", "2020-04-28 18:33:50.967202"], ["id", 9]]